#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Reading...
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Reading...
module.fourkeys.data.archive_file.events_bq_writer_source: Reading...
module.fourkeys.data.archive_file.demo: Reading...
module.fourkeys.module.test_artifact_registry_url_demo.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.data.external.env_override[0]: Read complete after 0s [id=-]
module.fourkeys.data.archive_file.demo: Read complete after 0s [id=6c1bb5ba27bd83aabb22cffba9470a9ca91073b6]
module.fourkeys.data.archive_file.load_gh_audit_log_source: Reading...
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_command[0]: Refreshing state... [id=6469184184091429422]
module.fourkeys.module.test_artifact_registry_url_demo.null_resource.run_destroy_command[0]: Refreshing state... [id=795832857450092111]
module.fourkeys.data.archive_file.load_gh_audit_log_source: Read complete after 0s [id=3e3b591035611305364327833ac77c3158d209d0]
module.fourkeys.data.archive_file.events_bq_writer_source: Read complete after 0s [id=6f2d6c347b7f4e8eba5d12946eda38b1d84b2af7]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_command[0]: Refreshing state... [id=2671861280509006243]
module.fourkeys.module.gcloud_build_batch_events_bq_writer.null_resource.run_destroy_command[0]: Refreshing state... [id=7501264970071068882]
module.fourkeys.google_service_account.unleash_sa: Refreshing state... [id=projects/off-net-dev/serviceAccounts/unleash-sa@off-net-dev.iam.gserviceaccount.com]
module.fourkeys.data.google_project.project: Reading...
module.fourkeys.google_storage_bucket_iam_member.destination_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-archieve-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Reading...
module.fourkeys.google_storage_bucket.gh_audit_log_station_local: Refreshing state... [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_storage_bucket.dump_logs: Refreshing state... [id=off-net-dev-batch-gh-audit-logs]
module.fourkeys.google_storage_bucket.function_bucket: Refreshing state... [id=off-net-dev-function-gh-log-source]
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Reading...
module.fourkeys.google_storage_bucket.gh_audit_log_archieve_local: Refreshing state... [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo]
module.fourkeys.google_storage_bucket_iam_member.source_bucket_access_logs: Refreshing state... [id=b/off-net-dev-gh-audit-log-station-local/roles/storage.admin/serviceAccount:project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.data.google_storage_bucket.gh_audit_log_station_local: Read complete after 0s [id=off-net-dev-gh-audit-log-station-local]
module.fourkeys.google_cloud_run_service.batch_events_bq_writer: Refreshing state... [id=locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer]
module.fourkeys.google_storage_bucket.events_station_local: Refreshing state... [id=off-net-dev-events-station-local]
module.fourkeys.google_storage_bucket.events_archieve_local: Refreshing state... [id=off-net-dev-events-archieve-local]
module.fourkeys.google_bigquery_dataset.dataset: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys]
module.fourkeys.google_storage_bucket.batch_gh_log_function_bucket: Refreshing state... [id=off-net-dev-batch-gh-log-function]
module.fourkeys.data.google_project.project: Read complete after 0s [id=projects/off-net-dev]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Reading...
module.fourkeys.google_storage_bucket_object.load_gh_audit_log_zip: Refreshing state... [id=off-net-dev-function-gh-log-source-src-6638472b3dc9ee579dea7de9b53921b5.zip]
module.fourkeys.google_eventarc_trigger.gh_logs_trigger_demo: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/gh-logs-trigger-demo]
module.fourkeys.google_eventarc_trigger.primary: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/triggers/name]
module.fourkeys.google_bigquery_table.batch_logs: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_logs]
module.fourkeys.google_bigquery_table.batch_events: Refreshing state... [id=projects/off-net-dev/datasets/local_4keys/tables/batch_events]
module.fourkeys.data.google_storage_transfer_project_service_account.logs: Read complete after 1s [id=project-541105984323@storage-transfer-service.iam.gserviceaccount.com]
module.fourkeys.google_storage_transfer_job.batch_logs_transfer_job: Refreshing state... [id=off-net-dev/2870788994826366552]
module.fourkeys.data.google_storage_bucket.gh_audit_log_archieve_local: Read complete after 1s [id=off-net-dev-gh-audit-log-archieve-local]
module.fourkeys.google_cloudfunctions2_function.event_function: Refreshing state... [id=projects/off-net-dev/locations/northamerica-northeast1/functions/batch-gh-log-handler-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.fourkeys.google_cloud_run_service.batch_events_bq_writer will be updated in-place
  ~ resource "google_cloud_run_service" "batch_events_bq_writer" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-events-bq-writer"
        name                       = "batch-events-bq-writer"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloud_run_service.batch_logs_bq_writer_demo will be updated in-place
  ~ resource "google_cloud_run_service" "batch_logs_bq_writer_demo" {
        id                         = "locations/northamerica-northeast1/namespaces/off-net-dev/services/batch-logs-bq-writer-demo"
        name                       = "batch-logs-bq-writer-demo"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fourkeys.google_cloudfunctions2_function.event_function will be updated in-place
  ~ resource "google_cloudfunctions2_function" "event_function" {
        id               = "projects/off-net-dev/locations/northamerica-northeast1/functions/batch-gh-log-handler-2"
        name             = "batch-gh-log-handler-2"
        # (10 unchanged attributes hidden)

      ~ build_config {
          - docker_repository     = "projects/off-net-dev/locations/northamerica-northeast1/repositories/gcf-artifacts" -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ event_trigger {
          - retry_policy          = "RETRY_POLICY_DO_NOT_RETRY" -> null
          - trigger_region        = "northamerica-northeast1" -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fourkeys.google_iam_workforce_pool.pool will be created
  + resource "google_iam_workforce_pool" "pool" {
      + id                = (known after apply)
      + location          = "global"
      + name              = (known after apply)
      + parent            = "organizations/off-net-dev"
      + session_duration  = "3600s"
      + state             = (known after apply)
      + workforce_pool_id = "unleash-pool"
    }

  # module.fourkeys.google_iam_workforce_pool_provider.provider will be created
  + resource "google_iam_workforce_pool_provider" "provider" {
      + attribute_condition = "true"
      + attribute_mapping   = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.aud"        = "assertion.aud"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + description         = "A sample OIDC workforce pool provider."
      + disabled            = false
      + display_name        = "oidc name"
      + id                  = (known after apply)
      + location            = "global"
      + name                = (known after apply)
      + provider_id         = "unleash-provider"
      + state               = (known after apply)
      + workforce_pool_id   = "unleash-pool"

      + oidc {
          + client_id  = "client-id"
          + issuer_uri = "https://token.actions.githubusercontent.com"

          + client_secret {
              + value {
                  + plain_text = (sensitive value)
                  + thumbprint = (known after apply)
                }
            }

          + web_sso_config {
              + additional_scopes         = [
                  + "groups",
                  + "roles",
                ]
              + assertion_claims_behavior = "MERGE_USER_INFO_OVER_ID_TOKEN_CLAIMS"
              + response_type             = "CODE"
            }
        }
    }

  # module.fourkeys.google_service_account.unleash_sa will be destroyed
  # (because google_service_account.unleash_sa is not in configuration)
  - resource "google_service_account" "unleash_sa" {
      - account_id   = "unleash-sa" -> null
      - disabled     = false -> null
      - display_name = "Unleash Service Account" -> null
      - email        = "unleash-sa@off-net-dev.iam.gserviceaccount.com" -> null
      - id           = "projects/off-net-dev/serviceAccounts/unleash-sa@off-net-dev.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:unleash-sa@off-net-dev.iam.gserviceaccount.com" -> null
      - name         = "projects/off-net-dev/serviceAccounts/unleash-sa@off-net-dev.iam.gserviceaccount.com" -> null
      - project      = "off-net-dev" -> null
      - unique_id    = "109506229332420503880" -> null
    }

Plan: 2 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*